src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/Enums/гпр_ВидыМетаданных/гпр_ВидыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гпр_ВидыМетаданных</name>
  <enumValues>
    <name>БизнесПроцесс</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийИсточникДанных</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>ЖурналДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЗадачаИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>Константа</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяКоманда</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяФорма</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>ПараметрСеанса</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовРасчета</name>
  </enumValues>
  <enumValues>
    <name>ПланВидовХарактеристик</name>
  </enumValues>
  <enumValues>
    <name>ПланОбмена</name>
  </enumValues>
  <enumValues>
    <name>ПланСчетов</name>
  </enumValues>
  <enumValues>
    <name>Подсистема</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>РегистрНакоплений</name>
  </enumValues>
  <enumValues>
    <name>РегистрРасчета</name>
  </enumValues>
  <enumValues>
    <name>РегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
  <enumValues>
    <name>ОбщийРеквизит</name>
  </enumValues>
  <enumValues>
    <name>КритерийОтбора</name>
  </enumValues>
</mdclass:Enum>

src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/Enums/гпр_ТипыРеквизитовОбъекта/гпр_ТипыРеквизитовОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гпр_ТипыРеквизитовОбъекта</name>
  <enumValues>
    <name>Измерение</name>
  </enumValues>
  <enumValues>
    <name>Команда</name>
  </enumValues>
  <enumValues>
    <name>Куб</name>
  </enumValues>
  <enumValues>
    <name>Перерасчет</name>
  </enumValues>
  <enumValues>
    <name>ПризнакУчета</name>
  </enumValues>
  <enumValues>
    <name>ПризнакУчетаСубконто</name>
  </enumValues>
  <enumValues>
    <name>Реквизит</name>
  </enumValues>
  <enumValues>
    <name>РеквизитАдресации</name>
  </enumValues>
  <enumValues>
    <name>РеквизитТабличнойЧасти</name>
  </enumValues>
  <enumValues>
    <name>Ресурс</name>
  </enumValues>
  <enumValues>
    <name>СтандартнаяТабличнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>СтандартныйРеквизит</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ТабличнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>Функция</name>
  </enumValues>
</mdclass:Enum>

src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/Enums/гпр_ПраваДоступа/гпр_ПраваДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гпр_ПраваДоступа</name>
  <enumValues>
    <name>Automation</name>
  </enumValues>
  <enumValues>
    <name>Администрирование</name>
  </enumValues>
  <enumValues>
    <name>АдминистрированиеДанных</name>
  </enumValues>
  <enumValues>
    <name>АдминистрированиеРасширенийКонфигурации</name>
  </enumValues>
  <enumValues>
    <name>АктивныеПользователи</name>
  </enumValues>
  <enumValues>
    <name>ВводПоСтроке</name>
  </enumValues>
  <enumValues>
    <name>ВебКлиент</name>
  </enumValues>
  <enumValues>
    <name>ВнешнееСоединение</name>
  </enumValues>
  <enumValues>
    <name>Вывод</name>
  </enumValues>
  <enumValues>
    <name>Добавление</name>
  </enumValues>
  <enumValues>
    <name>ЖурналРегистрации</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивнаяОтменаПроведения</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивнаяПометкаУдаления</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеДобавление</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеОткрытиеВнешнихОбработок</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеОткрытиеВнешнихОтчетов</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеПроведение</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеПроведениеНеОперативное</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеУдаление</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеУдалениеПомеченных</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>МонопольныйРежим</name>
  </enumValues>
  <enumValues>
    <name>ОбновлениеКонфигурацииБазыДанных</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПроведения</name>
  </enumValues>
  <enumValues>
    <name>Проведение</name>
  </enumValues>
  <enumValues>
    <name>Просмотр</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияСистемыВзаимодействия</name>
  </enumValues>
  <enumValues>
    <name>Редактирование</name>
  </enumValues>
  <enumValues>
    <name>РежимВсеФункции</name>
  </enumValues>
  <enumValues>
    <name>СохранениеДанныхПользователя</name>
  </enumValues>
  <enumValues>
    <name>ТолстыйКлиент</name>
  </enumValues>
  <enumValues>
    <name>ТонкийКлиент</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>УправлениеИтогами</name>
  </enumValues>
  <enumValues>
    <name>Чтение</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеИсторииДанных</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеИсторииДанныхОтсутсвующихДанных</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеКомментарияВерсииИсторииДанных</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеНастроекИсторииДанных</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивнаяПометкаНаУдалениеПредопределенных</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеСнятиеПометкиУдаления</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеСнятиеПометкиУдаленияПредопределенных</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеУдалениеПомеченныхПредопределенных</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеУдалениеПредопределенных</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаВерсиюИсторииДанных</name>
  </enumValues>
  <enumValues>
    <name>ПросмотрИсторииДанных</name>
  </enumValues>
  <enumValues>
    <name>РедактированияКомментарияВерсииИсторииДанных</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеИсторииДанных</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеИсторииДанныхОтсутствующихДанных</name>
  </enumValues>
  <enumValues>
    <name>Получение</name>
  </enumValues>
  <enumValues>
    <name>Установка</name>
  </enumValues>
  <enumValues>
    <name>ИнтерактивноеИзменениеПроведенных</name>
  </enumValues>
</mdclass:Enum>

src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/CommonModules/гпр_РаботаСКонфигурациейСерверПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОбъектыКонфигурации() Экспорт

	Результат = Новый Массив();
	
	ОсновнойПорядокМетаданныхВДереве = гпр_РаботаСКонфигурациейСервер.ОсновнойПорядокМетаданныхВДереве();
	
	Для Каждого ВидМетаданных Из ОсновнойПорядокМетаданныхВДереве Цикл
	
		ИмяМетаданных = Перечисления.гпр_ВидыМетаданных.ИмяМетаданныхПоВидуМетаданных(ВидМетаданных);
		ОбъектыМетаданных = Новый Соответствие();
		ПолучитьОбъектыКонфигурации(ИмяМетаданных, ОбъектыМетаданных);
	
		ПредставлениеМетаданных = гпр_РаботаСКонфигурациейСервер.ПредставлениеМетаданных(ИмяМетаданных);
		ОбъектыМетаданных.Вставить("ПредставлениеМетаданных", ПредставлениеМетаданных);
		Результат.Добавить(Новый Структура("Ключ,Значение", ВидМетаданных, ОбъектыМетаданных));
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОсновнойПорядокМетаданныхВДереве() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.Подсистема);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ПараметрСеанса);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ПланОбмена);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.КритерийОтбора);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ОбщаяФорма);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.Константа);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.Справочник);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.Документ);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ЖурналДокументов);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.Отчет);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.Обработка);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ПланСчетов);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.РегистрСведений);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.РегистрНакоплений);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.РегистрРасчета);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.БизнесПроцесс);
	Результат.Добавить(Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя);
	Возврат Результат;
		
КонецФункции

Функция ПараметрыЗаполненияПравДоступа() Экспорт
	
	ПараметрыПравДоступа = Новый Массив();
	ПараметрыПравДоступа.Добавить("ТипРеквизита");
	ПараметрыПравДоступа.Добавить("ИмяРеквизита");
	ПараметрыПравДоступа.Добавить("ИмяРеквизитаТабличнойЧасти");
	ПараметрыПравДоступа.Добавить("ПравоДоступа");
	ПараметрыПравДоступа.Добавить("ЗначениеПраваДоступа");
	ПараметрыПравДоступа.Добавить("ИдентификаторСтроки");
	
	Возврат ПараметрыПравДоступа;
	
КонецФункции

#Область гпр_ТипыРеквизитовОбъекта

Функция КартинкиРеквизитов() Экспорт
	
	КоллекцияКартинок = Новый Соответствие();
	КоллекцияКартинок.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Команда, БиблиотекаКартинок.гпр_ОбщаяКоманда);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Реквизит, БиблиотекаКартинок.Реквизит);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитТабличнойЧасти, БиблиотекаКартинок.Реквизит);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартныйРеквизит, БиблиотекаКартинок.гпр_СтандартныйРеквизит);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.ТабличнаяЧасть, БиблиотекаКартинок.ВложеннаяТаблица);
	
	// TODO: Все картники добавить
	//КоллекцияКартинок.Вставить(Измерение, БиблиотекаКартинок.Измерение);
	//КоллекцияКартинок.Вставить(Куб, БиблиотекаКартинок.Документ);
	//КоллекцияКартинок.Вставить(Перерасчет, БиблиотекаКартинок.ЖурналДокументов);
	//КоллекцияКартинок.Вставить(ПризнакУчета, БиблиотекаКартинок.Задача);
	//КоллекцияКартинок.Вставить(ПризнакУчетаСубконто, БиблиотекаКартинок.Константа);
	//КоллекцияКартинок.Вставить(РеквизитАдресации, БиблиотекаКартинок.гпр_ОбщаяКоманда);
	//КоллекцияКартинок.Вставить(Ресурс, БиблиотекаКартинок.Отчет);
	КоллекцияКартинок.Вставить(
		Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартнаяТабличнаяЧасть,
		БиблиотекаКартинок.ВложеннаяТаблица);
	//КоллекцияКартинок.Вставить(Таблица, БиблиотекаКартинок.ПланВидовХарактеристик);
	//КоллекцияКартинок.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Функция, БиблиотекаКартинок.ПланСчетов); 
	
	Возврат КоллекцияКартинок;

КонецФункции

Функция ИменаГруппСТипамиРеквизитов() Экспорт
	
	ИменаГруппРеквизитов = Новый Соответствие();
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Измерение, "Измерения");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Команда, "Команды");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Куб, "Кубы");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Перерасчет, "Перерасчет");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.ПризнакУчета, "ПризнакиУчета");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.ПризнакУчетаСубконто, "ПризнакиУчетаСубконто");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Реквизит, "Реквизиты");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитАдресации, "РеквизитыАдресации");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитТабличнойЧасти, "Реквизиты");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Ресурс, "Ресурсы");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартнаяТабличнаяЧасть, "СтандартныеТабличныеЧасти");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартныйРеквизит, "СтандартныеРеквизиты");  
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Таблица, "Таблицы");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.ТабличнаяЧасть, "ТабличныеЧасти");
	ИменаГруппРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Функция, "Функции"); 
	
	Возврат ИменаГруппРеквизитов;
	
КонецФункции

Функция ИменаРеквизитовСТипамиРасширений() Экспорт
	
	ИменаРеквизитов = Новый Соответствие();
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Измерение, "Dimension");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Команда, "Command");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Куб, "Cube");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Перерасчет, "Recalculation");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.ПризнакУчета, "AccountingFlag");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.ПризнакУчетаСубконто, "ExtDimensionAccountingFlag");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Реквизит, "Attribute");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитАдресации, "AddressingAttribute");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитТабличнойЧасти, "Attribute");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Ресурс, "Resource");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартнаяТабличнаяЧасть, "StandardTabularSection");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартныйРеквизит, "StandardAttribute");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Таблица, "Table");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.ТабличнаяЧасть, "TabularSection");
	ИменаРеквизитов.Вставить(Перечисления.гпр_ТипыРеквизитовОбъекта.Функция, "Function"); 
	
	Возврат ИменаРеквизитов;
	
КонецФункции

Функция ТипыРеквизитовПоИмениОбъектаРасширения() Экспорт
	
	ИменаРеквизитов = Новый Соответствие();
	ИменаРеквизитов.Вставить("Dimension", Перечисления.гпр_ТипыРеквизитовОбъекта.Измерение);
	ИменаРеквизитов.Вставить("Command", Перечисления.гпр_ТипыРеквизитовОбъекта.Команда);
	ИменаРеквизитов.Вставить("Cube", Перечисления.гпр_ТипыРеквизитовОбъекта.Куб);
	ИменаРеквизитов.Вставить("Recalculation", Перечисления.гпр_ТипыРеквизитовОбъекта.Перерасчет);
	ИменаРеквизитов.Вставить("AccountingFlag", Перечисления.гпр_ТипыРеквизитовОбъекта.ПризнакУчета);
	ИменаРеквизитов.Вставить("ExtDimensionAccountingFlag", Перечисления.гпр_ТипыРеквизитовОбъекта.ПризнакУчетаСубконто);
	ИменаРеквизитов.Вставить("Attribute", Перечисления.гпр_ТипыРеквизитовОбъекта.Реквизит);
	ИменаРеквизитов.Вставить("AddressingAttribute", Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитАдресации);
	ИменаРеквизитов.Вставить("Attribute", Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитТабличнойЧасти);
	ИменаРеквизитов.Вставить("Resource", Перечисления.гпр_ТипыРеквизитовОбъекта.Ресурс);
	ИменаРеквизитов.Вставить("StandardTabularSection", Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартнаяТабличнаяЧасть);
	ИменаРеквизитов.Вставить("StandardAttribute", Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартныйРеквизит);
	ИменаРеквизитов.Вставить("Table", Перечисления.гпр_ТипыРеквизитовОбъекта.Таблица);
	ИменаРеквизитов.Вставить("TabularSection", Перечисления.гпр_ТипыРеквизитовОбъекта.ТабличнаяЧасть);
	ИменаРеквизитов.Вставить("TabularSection", Перечисления.гпр_ТипыРеквизитовОбъекта.Функция); 
	
	Возврат ИменаРеквизитов;
	
КонецФункции

#КонецОбласти

#Область гпр_ВидыМетаданных

Функция ИменаВидовМетаданныхВЕдинственномЧисле() Экспорт
	
	МетаданныеОбъетов = Новый Соответствие();
	
	
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.БизнесПроцесс, "БизнесПроцессы");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных, "ВнешниеИсточникиДанных");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Документ, "Документы");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЖурналДокументов, "ЖурналыДокументов");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя, "Задачи");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Константа, "Константы");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Обработка, "Обработки");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда, "ОбщиеКоманды");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяФорма, "ОбщиеФормы");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Отчет, "Отчеты");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПараметрСеанса, "ПараметрыСеанса");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета, "ПланыВидовРасчета");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик, "ПланыВидовХарактеристик");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланОбмена, "ПланыОбмена");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланСчетов, "ПланыСчетов");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии, "РегистрыБухгалтерии");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрНакоплений, "РегистрыНакопления");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Подсистема, "Подсистемы");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрРасчета, "РегистрыРасчета");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрСведений, "РегистрыСведений");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Справочник, "Справочники");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит, "ОбщиеРеквизиты");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.КритерийОтбора, "КритерииОтбора");
	Возврат МетаданныеОбъетов;
	
КонецФункции

Функция ИменаВидовМетаданныхВоМножественномЧисле() Экспорт
	
	МетаданныеОбъетов = Новый Соответствие();
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.БизнесПроцесс, "БизнесПроцесс");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных, "ВнешнийИсточникДанных");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Документ, "Документ");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЖурналДокументов, "ЖурналДокументов");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя, "ЗадачаИсполнителя");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Константа, "Константа");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Обработка, "Обработка");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда, "ОбщаяКоманда");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяФорма, "ОбщаяФорма");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Отчет, "Отчет");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПараметрСеанса, "ПараметрСеанса");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета, "ПланВидовРасчета");   
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик, "ПланВидовХарактеристик");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланОбмена, "ПланОбмена");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланСчетов, "ПланСчетов");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии, "РегистрБухгалтерии");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрНакоплений, "РегистрНакопления");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Подсистема, "Подсистема");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрРасчета, "РегистрРасчета");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрСведений, "РегистрСведений");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Справочник, "Справочник");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит, "ОбщийРеквизит");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.КритерийОтбора, "КритерийОтбора");
	
	Возврат МетаданныеОбъетов;
	
КонецФункции

Функция КартинкиМетаданных() Экспорт
	
	КоллекцияКартинок = Новый Соответствие();
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.БизнесПроцесс, БиблиотекаКартинок.БизнесПроцесс);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных, БиблиотекаКартинок.ВнешнийИсточникДанных);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.Документ, БиблиотекаКартинок.Документ);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ЖурналДокументов, БиблиотекаКартинок.ЖурналДокументов);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя, БиблиотекаКартинок.Задача);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.Константа, БиблиотекаКартинок.Константа);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.Обработка, БиблиотекаКартинок.Обработка);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда, БиблиотекаКартинок.гпр_ОбщаяКоманда);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяФорма, БиблиотекаКартинок.Форма);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.Отчет, БиблиотекаКартинок.Отчет);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ПараметрСеанса, БиблиотекаКартинок.гпр_ПараметрСеанса);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета, БиблиотекаКартинок.ПланВидовРасчета);  
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристик);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ПланОбмена, БиблиотекаКартинок.ПланОбмена);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ПланСчетов, БиблиотекаКартинок.ПланСчетов);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии, БиблиотекаКартинок.РегистрБухгалтерии);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрНакоплений, БиблиотекаКартинок.РегистрНакопления);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.Подсистема, БиблиотекаКартинок.гпр_Подсистема);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрРасчета, БиблиотекаКартинок.РегистрРасчета);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрСведений, БиблиотекаКартинок.РегистрСведений);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.Справочник, БиблиотекаКартинок.Справочник); 
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит, БиблиотекаКартинок.Реквизит);
	КоллекцияКартинок.Вставить(Перечисления.гпр_ВидыМетаданных.КритерийОтбора, БиблиотекаКартинок.КритерийОтбора);
	Возврат КоллекцияКартинок;
	
КонецФункции

Функция ИменаМетаданныхПоВидуМетаданныхДляРасширения() Экспорт
	
	МетаданныеОбъетов = Новый Соответствие();
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.БизнесПроцесс, "BusinessProcesses");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных, "ExternalDataSources");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Документ, "Documents");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЖурналДокументов, "DocumentJournals");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя, "Tasks");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Константа, "Constants");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Обработка, "DataProcessors");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда, "CommonCommands");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяФорма, "CommonForms");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Отчет, "Reports");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПараметрСеанса, "SessionParameters");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета, "ChartsOfCalculationTypes");  
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик, "ChartsOfCharacteristicTypes");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланОбмена, "ExchangePlans");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланСчетов, "ChartsOfAccounts");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии, "AccountingRegisters");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрНакоплений, "AccumulationRegisters");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Подсистема, "Subsystems");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрРасчета, "CalculationRegisters");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрСведений, "InformationRegisters");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Справочник, "Catalogs");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.КритерийОтбора, "FilterCriteria");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит, "CommonAttributes");
	
	Возврат МетаданныеОбъетов;
	
КонецФункции

Функция ИменаВидаОбъектаПоВидуМетаданныхДляРасширения() Экспорт
	
	МетаданныеОбъетов = Новый Соответствие();
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.БизнесПроцесс, "BusinessProcess");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных, "ExternalDataSource");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Документ, "Document");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЖурналДокументов, "DocumentJournal");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя, "Task");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Константа, "Constant");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Обработка, "DataProcessor");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда, "CommonCommand");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщаяФорма, "CommonForm");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Отчет, "Report");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПараметрСеанса, "SessionParameter");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета, "ChartOfCalculationTypes");   
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик, "ChartOfCharacteristicTypes");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланОбмена, "ExchangePlan");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланСчетов, "ChartOfAccounts");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии, "AccountingRegister");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрНакоплений, "AccumulationRegister");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Подсистема, "Subsystem");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрРасчета, "CalculationRegister");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрСведений, "InformationRegister");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Справочник, "Catalog");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.КритерийОтбора, "FilterCriterion");
	МетаданныеОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит, "CommonAttribute");
	Возврат МетаданныеОбъетов;
	
КонецФункции

Функция ВидыОбъектовПоИмениМетаданныхРасширения() Экспорт
	
	МетаданныеОбъетов = Новый Соответствие();
	МетаданныеОбъетов.Вставить("BusinessProcess", Перечисления.гпр_ВидыМетаданных.БизнесПроцесс);
	МетаданныеОбъетов.Вставить("ExternalDataSource", Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных);
	МетаданныеОбъетов.Вставить("Document", Перечисления.гпр_ВидыМетаданных.Документ);
	МетаданныеОбъетов.Вставить("DocumentJournal", Перечисления.гпр_ВидыМетаданных.ЖурналДокументов);
	МетаданныеОбъетов.Вставить("Task", Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя);
	МетаданныеОбъетов.Вставить("Constant", Перечисления.гпр_ВидыМетаданных.Константа);
	МетаданныеОбъетов.Вставить("DataProcessor", Перечисления.гпр_ВидыМетаданных.Обработка);
	МетаданныеОбъетов.Вставить("CommonCommand", Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда);
	МетаданныеОбъетов.Вставить("CommonForm", Перечисления.гпр_ВидыМетаданных.ОбщаяФорма);
	МетаданныеОбъетов.Вставить("Report", Перечисления.гпр_ВидыМетаданных.Отчет);
	МетаданныеОбъетов.Вставить("SessionParameter", Перечисления.гпр_ВидыМетаданных.ПараметрСеанса);
	МетаданныеОбъетов.Вставить("ChartOfCalculationTypes", Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета);   
	МетаданныеОбъетов.Вставить("ChartOfCharacteristicTypes", Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик);
	МетаданныеОбъетов.Вставить("ExchangePlan", Перечисления.гпр_ВидыМетаданных.ПланОбмена);
	МетаданныеОбъетов.Вставить("ChartOfAccounts", Перечисления.гпр_ВидыМетаданных.ПланСчетов);
	МетаданныеОбъетов.Вставить("AccountingRegister", Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии);
	МетаданныеОбъетов.Вставить("AccumulationRegister", Перечисления.гпр_ВидыМетаданных.РегистрНакоплений);
	МетаданныеОбъетов.Вставить("Subsystem", Перечисления.гпр_ВидыМетаданных.Подсистема);
	МетаданныеОбъетов.Вставить("CalculationRegister", Перечисления.гпр_ВидыМетаданных.РегистрРасчета);
	МетаданныеОбъетов.Вставить("InformationRegister", Перечисления.гпр_ВидыМетаданных.РегистрСведений);
	МетаданныеОбъетов.Вставить("Catalog", Перечисления.гпр_ВидыМетаданных.Справочник);
	МетаданныеОбъетов.Вставить("FilterCriterion", Перечисления.гпр_ВидыМетаданных.КритерийОтбора);
	МетаданныеОбъетов.Вставить("CommonAttribute", Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит);
	
	Возврат МетаданныеОбъетов;
	
КонецФункции

Функция ВидМетаданныхПоИмениВЕдинственномЧисле() Экспорт
	
	МетаданныеОбъетов = Новый Соответствие();
	МетаданныеОбъетов.Вставить("БизнесПроцесс", Перечисления.гпр_ВидыМетаданных.БизнесПроцесс);
	МетаданныеОбъетов.Вставить("ВнешнийИсточникДанных", Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных);
	МетаданныеОбъетов.Вставить("Документ", Перечисления.гпр_ВидыМетаданных.Документ);
	МетаданныеОбъетов.Вставить("ЖурналДокументов", Перечисления.гпр_ВидыМетаданных.ЖурналДокументов);
	МетаданныеОбъетов.Вставить("Задача", Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя);
	МетаданныеОбъетов.Вставить("Константа", Перечисления.гпр_ВидыМетаданных.Константа);
	МетаданныеОбъетов.Вставить("Обработка", Перечисления.гпр_ВидыМетаданных.Обработка);
	МетаданныеОбъетов.Вставить("ОбщаяКоманда", Перечисления.гпр_ВидыМетаданных.ОбщаяКоманда);
	МетаданныеОбъетов.Вставить("ОбщаяФорма", Перечисления.гпр_ВидыМетаданных.ОбщаяФорма);
	МетаданныеОбъетов.Вставить("Отчет", Перечисления.гпр_ВидыМетаданных.Отчет);
	МетаданныеОбъетов.Вставить("ПараметрСеанса", Перечисления.гпр_ВидыМетаданных.ПараметрСеанса);
	МетаданныеОбъетов.Вставить("ПланВидовРасчета", Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета);   
	МетаданныеОбъетов.Вставить("ПланВидовХарактеристик", Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик);
	МетаданныеОбъетов.Вставить("ПланОбмена", Перечисления.гпр_ВидыМетаданных.ПланОбмена);
	МетаданныеОбъетов.Вставить("ПланСчетов", Перечисления.гпр_ВидыМетаданных.ПланСчетов);
	МетаданныеОбъетов.Вставить("РегистрБухгалтерии", Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии);
	МетаданныеОбъетов.Вставить("РегистрНакопления", Перечисления.гпр_ВидыМетаданных.РегистрНакоплений);
	МетаданныеОбъетов.Вставить("Подсистема", Перечисления.гпр_ВидыМетаданных.Подсистема);
	МетаданныеОбъетов.Вставить("РегистрРасчета", Перечисления.гпр_ВидыМетаданных.РегистрРасчета);
	МетаданныеОбъетов.Вставить("РегистрСведений", Перечисления.гпр_ВидыМетаданных.РегистрСведений);
	МетаданныеОбъетов.Вставить("Справочник", Перечисления.гпр_ВидыМетаданных.Справочник);
	МетаданныеОбъетов.Вставить("ОбщийРеквизит", Перечисления.гпр_ВидыМетаданных.ОбщийРеквизит);
	МетаданныеОбъетов.Вставить("КритерийОтбора", Перечисления.гпр_ВидыМетаданных.КритерийОтбора);
	МетаданныеОбъетов.Вставить("ТочкаМаршрутаБизнесПроцесса", Перечисления.гпр_ВидыМетаданных.БизнесПроцесс);
	Возврат МетаданныеОбъетов;
	
КонецФункции

Функция МенеджерОбъектаПоВидуМетаданных() Экспорт
	
	МенеджерыОбъетов = Новый Соответствие();
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.БизнесПроцесс, БизнесПроцессы);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ВнешнийИсточникДанных, ВнешниеИсточникиДанных);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Документ, Документы);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЖурналДокументов, ЖурналыДокументов);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ЗадачаИсполнителя, Задачи);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Константа, Константы);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Обработка, Обработки);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Отчет, Отчеты);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПараметрСеанса, ПараметрыСеанса);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовРасчета, ПланыВидовРасчета);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланВидовХарактеристик, ПланыВидовХарактеристик);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланОбмена, ПланыОбмена);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.ПланСчетов, ПланыСчетов);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрБухгалтерии, РегистрыБухгалтерии);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрНакоплений, РегистрыНакопления);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрРасчета, РегистрыРасчета);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.РегистрСведений, РегистрыСведений);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.Справочник, Справочники);
	МенеджерыОбъетов.Вставить(Перечисления.гпр_ВидыМетаданных.КритерийОтбора, КритерииОтбора);
	Возврат МенеджерыОбъетов;
	
КонецФункции

#КонецОбласти

#Область ДеревоОбъектовКонфигурации

Функция ОписаниеГруппыКоманды() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Представление", НСтр("ru = 'Команды'"));
	Результат.Вставить("Картинка", БиблиотекаКартинок.гпр_ОбщаяКоманда);
	Результат.Вставить("ТипРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.Команда);
	Результат.Вставить("ИмяТипаРеквизита", "Команды");
	Результат.Вставить("РеквизитРеквизита", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ОписаниеГруппыСтандартныеРеквизиты() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Представление", НСтр("ru = 'СтандартныеРеквизиты'"));
	Результат.Вставить("Картинка", БиблиотекаКартинок.гпр_СтандартныйРеквизит);
	Результат.Вставить("ТипРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартныйРеквизит);
	Результат.Вставить("ИмяТипаРеквизита", "СтандартныеРеквизиты");
	Результат.Вставить("РеквизитРеквизита", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ОписаниеГруппыСтандартныеТабличныеЧасти() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Представление", НСтр("ru = 'Стандартные табличные части'"));
	Результат.Вставить("Картинка", БиблиотекаКартинок.ВложеннаяТаблица);
	Результат.Вставить("ТипРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартнаяТабличнаяЧасть);
	Результат.Вставить("ИмяТипаРеквизита", "СтандартныеТабличныеЧасти");
	Результат.Вставить("РеквизитРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.СтандартныйРеквизит);
	Возврат Результат;
	
КонецФункции

Функция ОписаниеГруппыТабличныеЧасти() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Представление", НСтр("ru = 'Табличные части'"));
	Результат.Вставить("Картинка", БиблиотекаКартинок.ВложеннаяТаблица);
	Результат.Вставить("ТипРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.ТабличнаяЧасть);
	Результат.Вставить("ИмяТипаРеквизита", "ТабличныеЧасти");
	Результат.Вставить("РеквизитРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.РеквизитТабличнойЧасти);
	Возврат Результат;
	
КонецФункции

Функция ОписаниеГруппыРеквизиты() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Представление", НСтр("ru = 'Реквизиты'"));
	Результат.Вставить("Картинка", БиблиотекаКартинок.Реквизит);
	Результат.Вставить("ТипРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.Реквизит);
	Результат.Вставить("ИмяТипаРеквизита", "Реквизиты");
	Результат.Вставить("РеквизитРеквизита", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ОписаниеГруппыИзмерения() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Представление", НСтр("ru = 'Измерения'"));
	Результат.Вставить("Картинка", БиблиотекаКартинок.Измерение);
	Результат.Вставить("ТипРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.Измерение);
	Результат.Вставить("ИмяТипаРеквизита", "Измерения");
	Результат.Вставить("РеквизитРеквизита", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ОписаниеГруппыРесурсы() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Представление", НСтр("ru = 'Ресурсы'"));
	Результат.Вставить("Картинка", БиблиотекаКартинок.Ресурс);
	Результат.Вставить("ТипРеквизита", Перечисления.гпр_ТипыРеквизитовОбъекта.Ресурс);
	Результат.Вставить("ИмяТипаРеквизита", "Ресурсы");
	Результат.Вставить("РеквизитРеквизита", Неопределено);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаОбъектов

Функция СтандартныеРеквизитыОбъектовДляВыгрузки() Экспорт
	
	СписокРеквизитов = Новый Соответствие;
	СписокРеквизитов.Вставить("Ссылка", "Ref");
	СписокРеквизитов.Вставить("Проведен", "Posted");
	СписокРеквизитов.Вставить("ПометкаУдаления", "DeletionMark");
	СписокРеквизитов.Вставить("Дата", "Date");
	СписокРеквизитов.Вставить("Номер", "Number");
	СписокРеквизитов.Вставить("ТипЗначения", "ValueType");
	СписокРеквизитов.Вставить("Выполнена", "Executed");
	СписокРеквизитов.Вставить("Наименование", "Description");
	СписокРеквизитов.Вставить("ТочкаМаршрута", "RoutePoint");
	СписокРеквизитов.Вставить("БизнесПроцесс", "BusinessProcess");
	СписокРеквизитов.Вставить("ИмяПредопределенныхДанных", "PredefinedDataName");
	СписокРеквизитов.Вставить("Предопределенный", "Predefined");
	СписокРеквизитов.Вставить("Код", "Code");
	СписокРеквизитов.Вставить("ЭтотУзел", "ThisNode");
	СписокРеквизитов.Вставить("НомерПринятого", "ReceivedNo");
	СписокРеквизитов.Вставить("НомерОтправленного", "SentNo");
	СписокРеквизитов.Вставить("Забалансовый", "OffBalance");
	СписокРеквизитов.Вставить("Вид", "Type");
	СписокРеквизитов.Вставить("Счет", "Account");
	СписокРеквизитов.Вставить("ВидДвижения", "RecordType");
	СписокРеквизитов.Вставить("Активность", "Active");
	СписокРеквизитов.Вставить("НомерСтроки", "LineNumber");
	СписокРеквизитов.Вставить("Регистратор", "Recorder");
	СписокРеквизитов.Вставить("Период", "Period");
	СписокРеквизитов.Вставить("ПериодРегистрации", "RegistrationPeriod");
	СписокРеквизитов.Вставить("Сторно", "ReversingEntry");
	СписокРеквизитов.Вставить("ВидРасчета", "CalculationType");
	СписокРеквизитов.Вставить("Родитель", "Parent");
	СписокРеквизитов.Вставить("ЭтоГруппа", "IsFolder");
	СписокРеквизитов.Вставить("Владелец", "Owner");
	СписокРеквизитов.Вставить("Стартован", "Started");
	СписокРеквизитов.Вставить("ВедущаяЗадача", "HeadTask");
	СписокРеквизитов.Вставить("Завершен", "Completed");
	СписокРеквизитов.Вставить("Тип", "Type");
	СписокРеквизитов.Вставить("ВедущиеВидыРасчета", "LeadingCalculationTypes");
	СписокРеквизитов.Вставить("ВидыСубконто", "ExtDimensionTypes");
	СписокРеквизитов.Вставить("ТолькоОбороты", "TurnoversOnly");
	СписокРеквизитов.Вставить("Предопределенное", "Predefined");
	СписокРеквизитов.Вставить("ВидСубконто", "ExtDimensionType");
	СписокРеквизитов.Вставить("ВедущиеВидыРасчета", "LeadingCalculationTypes");
	СписокРеквизитов.Вставить("ВытесняющиеВидыРасчета", "DisplacingCalculationTypes");
	СписокРеквизитов.Вставить("БазовыеВидыРасчета", "BaseCalculationTypes");	

	Возврат СписокРеквизитов;
	
КонецФункции

Функция ИменаПравоДоступаДляВыгрузки() Экспорт
	
	СписокПравДоступа = Новый Соответствие();
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Automation, "Automation");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Администрирование, "Administration");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.АдминистрированиеРасширенийКонфигурации, "ConfigurationExtensionsAdministration");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.АктивныеПользователи, "ActiveUsers");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ВводПоСтроке, "InputByString");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ВебКлиент, "WebClient");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ВнешнееСоединение, "ExternalConnection");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Вывод, "Output");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Добавление, "Insert");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ЖурналРегистрации, "EventLog");
	//СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ЗначениеПеречисления, "Automation");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Изменение, "Update");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивнаяОтменаПроведения, "InteractiveUndoPosting");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивнаяПометкаУдаления, "InteractiveSetDeletionMark");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеДобавление, "InteractiveInsert");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеОткрытиеВнешнихОбработок, "InteractiveOpenExtDataProcessors");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеОткрытиеВнешнихОтчетов, "InteractiveOpenExtReports");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеПроведение, "InteractivePosting");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеПроведениеНеОперативное, "InteractivePostingRegular");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдаление, "InteractiveDelete");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПомеченных, "InteractiveDeleteMarked");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Использование, "Use");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.МонопольныйРежим, "ExclusiveMode");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ОбновлениеКонфигурацииБазыДанных, "UpdateDataBaseConfiguration");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ОтменаПроведения, "UndoPosting");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Проведение, "Posting");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Просмотр, "View");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.РегистрацияСистемыВзаимодействия, "CollaborationSystemInfoBaseRegistration");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Редактирование, "Edit");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.РежимВсеФункции, "allFunctionsMode");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.СохранениеДанныхПользователя, "SaveUserData");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ТолстыйКлиент, "ThickClient");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ТонкийКлиент, "ThinClient");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Удаление, "Delete");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.УправлениеИтогами, "TotalsControl");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Чтение, "Read");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеИсторииДанных, "UpdateDataHistory");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеИсторииДанныхОтсутсвующихДанных, "UpdateDataHistoryOfMissingData");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеКомментарияВерсииИсторииДанных, "UpdateDataHistoryVersionComment");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеНастроекИсторииДанных, "UpdateDataHistorySettings");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивнаяПометкаНаУдалениеПредопределенных, "InteractiveSetDeletionMarkPredefinedData");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеСнятиеПометкиУдаления, "InteractiveClearDeletionMark");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеСнятиеПометкиУдаленияПредопределенных, "InteractiveClearDeletionMarkPredefinedData");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПомеченныхПредопределенных, "InteractiveDeleteMarkedPredefinedData");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПредопределенных, "InteractiveDeletePredefinedData");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ПереходНаВерсиюИсторииДанных, "SwitchToDataHistoryVersion");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ПросмотрИсторииДанных, "ViewDataHistory");	
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.РедактированияКомментарияВерсииИсторииДанных, "EditDataHistoryVersionComment");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ЧтениеИсторииДанных, "ReadDataHistory");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ЧтениеИсторииДанныхОтсутствующихДанных, "ReadDataHistoryOfMissingData");	
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Получение, "Get");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.Установка, "Set");
	СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеИзменениеПроведенных, "InteractiveChangeOfPosted");
		
	Возврат СписокПравДоступа;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаОбъектов

Функция ПравоДоступаПоИмениЗагрузки() Экспорт
	
	СписокПравДоступа = Новый Соответствие();
	СписокПравДоступа.Вставить("Automation", Перечисления.гпр_ПраваДоступа.Automation);
	СписокПравДоступа.Вставить("Administration", Перечисления.гпр_ПраваДоступа.Администрирование);
	СписокПравДоступа.Вставить("ConfigurationExtensionsAdministration", Перечисления.гпр_ПраваДоступа.АдминистрированиеРасширенийКонфигурации);
	СписокПравДоступа.Вставить("ActiveUsers", Перечисления.гпр_ПраваДоступа.АктивныеПользователи);
	СписокПравДоступа.Вставить("InputByString", Перечисления.гпр_ПраваДоступа.ВводПоСтроке);
	СписокПравДоступа.Вставить("WebClient", Перечисления.гпр_ПраваДоступа.ВебКлиент);
	СписокПравДоступа.Вставить("ExternalConnection", Перечисления.гпр_ПраваДоступа.ВнешнееСоединение);
	СписокПравДоступа.Вставить("Output", Перечисления.гпр_ПраваДоступа.Вывод);
	СписокПравДоступа.Вставить("Insert", Перечисления.гпр_ПраваДоступа.Добавление);
	СписокПравДоступа.Вставить("EventLog", Перечисления.гпр_ПраваДоступа.ЖурналРегистрации);
	//СписокПравДоступа.Вставить(Перечисления.гпр_ПраваДоступа.ЗначениеПеречисления, "Automation");
	СписокПравДоступа.Вставить("Update", Перечисления.гпр_ПраваДоступа.Изменение);
	СписокПравДоступа.Вставить("InteractiveUndoPosting", Перечисления.гпр_ПраваДоступа.ИнтерактивнаяОтменаПроведения);
	СписокПравДоступа.Вставить("InteractiveSetDeletionMark", Перечисления.гпр_ПраваДоступа.ИнтерактивнаяПометкаУдаления);
	СписокПравДоступа.Вставить("InteractiveInsert", Перечисления.гпр_ПраваДоступа.ИнтерактивноеДобавление);
	СписокПравДоступа.Вставить("InteractiveOpenExtDataProcessors", Перечисления.гпр_ПраваДоступа.ИнтерактивноеОткрытиеВнешнихОбработок);
	СписокПравДоступа.Вставить("InteractiveOpenExtReports", Перечисления.гпр_ПраваДоступа.ИнтерактивноеОткрытиеВнешнихОтчетов);
	СписокПравДоступа.Вставить("InteractivePosting", Перечисления.гпр_ПраваДоступа.ИнтерактивноеПроведение);
	СписокПравДоступа.Вставить("InteractivePostingRegular", Перечисления.гпр_ПраваДоступа.ИнтерактивноеПроведениеНеОперативное);
	СписокПравДоступа.Вставить("InteractiveDelete", Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдаление);
	СписокПравДоступа.Вставить("InteractiveDeleteMarked", Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПомеченных);
	СписокПравДоступа.Вставить("Use", Перечисления.гпр_ПраваДоступа.Использование);
	СписокПравДоступа.Вставить("ExclusiveMode", Перечисления.гпр_ПраваДоступа.МонопольныйРежим);
	СписокПравДоступа.Вставить("UpdateDataBaseConfiguration", Перечисления.гпр_ПраваДоступа.ОбновлениеКонфигурацииБазыДанных);
	СписокПравДоступа.Вставить("UndoPosting", Перечисления.гпр_ПраваДоступа.ОтменаПроведения);
	СписокПравДоступа.Вставить("Posting", Перечисления.гпр_ПраваДоступа.Проведение);
	СписокПравДоступа.Вставить("View", Перечисления.гпр_ПраваДоступа.Просмотр);
	СписокПравДоступа.Вставить("CollaborationSystemInfoBaseRegistration", Перечисления.гпр_ПраваДоступа.РегистрацияСистемыВзаимодействия);
	СписокПравДоступа.Вставить("Edit", Перечисления.гпр_ПраваДоступа.Редактирование);
	СписокПравДоступа.Вставить("allFunctionsMode", Перечисления.гпр_ПраваДоступа.РежимВсеФункции);
	СписокПравДоступа.Вставить("SaveUserData", Перечисления.гпр_ПраваДоступа.СохранениеДанныхПользователя);
	СписокПравДоступа.Вставить("ThickClient", Перечисления.гпр_ПраваДоступа.ТолстыйКлиент);
	СписокПравДоступа.Вставить("ThinClient", Перечисления.гпр_ПраваДоступа.ТонкийКлиент);
	СписокПравДоступа.Вставить("Delete", Перечисления.гпр_ПраваДоступа.Удаление);
	СписокПравДоступа.Вставить("TotalsControl", Перечисления.гпр_ПраваДоступа.УправлениеИтогами);
	СписокПравДоступа.Вставить("Read", Перечисления.гпр_ПраваДоступа.Чтение);
	СписокПравДоступа.Вставить("UpdateDataHistory", Перечисления.гпр_ПраваДоступа.ИзменениеИсторииДанных);
	СписокПравДоступа.Вставить("UpdateDataHistoryOfMissingData", Перечисления.гпр_ПраваДоступа.ИзменениеИсторииДанныхОтсутсвующихДанных);
	СписокПравДоступа.Вставить("UpdateDataHistoryVersionComment", Перечисления.гпр_ПраваДоступа.ИзменениеКомментарияВерсииИсторииДанных);
	СписокПравДоступа.Вставить("UpdateDataHistorySettings", Перечисления.гпр_ПраваДоступа.ИзменениеНастроекИсторииДанных);
	СписокПравДоступа.Вставить("InteractiveSetDeletionMarkPredefinedData", Перечисления.гпр_ПраваДоступа.ИнтерактивнаяПометкаНаУдалениеПредопределенных);
	СписокПравДоступа.Вставить("InteractiveClearDeletionMark", Перечисления.гпр_ПраваДоступа.ИнтерактивноеСнятиеПометкиУдаления);
	СписокПравДоступа.Вставить("InteractiveClearDeletionMarkPredefinedData", Перечисления.гпр_ПраваДоступа.ИнтерактивноеСнятиеПометкиУдаленияПредопределенных);
	СписокПравДоступа.Вставить("InteractiveDeleteMarkedPredefinedData", Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПомеченныхПредопределенных);
	СписокПравДоступа.Вставить("InteractiveDeletePredefinedData", Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПредопределенных);
	СписокПравДоступа.Вставить("SwitchToDataHistoryVersion", Перечисления.гпр_ПраваДоступа.ПереходНаВерсиюИсторииДанных);
	СписокПравДоступа.Вставить("ViewDataHistory", Перечисления.гпр_ПраваДоступа.ПросмотрИсторииДанных);	
	СписокПравДоступа.Вставить("EditDataHistoryVersionComment", Перечисления.гпр_ПраваДоступа.РедактированияКомментарияВерсииИсторииДанных);
	СписокПравДоступа.Вставить("ReadDataHistory", Перечисления.гпр_ПраваДоступа.ЧтениеИсторииДанных);
	СписокПравДоступа.Вставить("ReadDataHistoryOfMissingData", Перечисления.гпр_ПраваДоступа.ЧтениеИсторииДанныхОтсутствующихДанных);	
	СписокПравДоступа.Вставить("Get", Перечисления.гпр_ПраваДоступа.Получение);
	СписокПравДоступа.Вставить("Set", Перечисления.гпр_ПраваДоступа.Установка);
	СписокПравДоступа.Вставить("InteractiveChangeOfPosted", Перечисления.гпр_ПраваДоступа.ИнтерактивноеИзменениеПроведенных);
		
	Возврат СписокПравДоступа;
	
КонецФункции

Функция РеквизитыОбъектовЗагрузки() Экспорт
	
	СписокРеквизитов = Новый Соответствие;
	СписокРеквизитов.Вставить("Ref", "Ссылка");
	СписокРеквизитов.Вставить("Posted", "Проведен");
	СписокРеквизитов.Вставить("DeletionMark", "ПометкаУдаления");
	СписокРеквизитов.Вставить("Date", "Дата");
	СписокРеквизитов.Вставить("Number", "Номер");
	СписокРеквизитов.Вставить("ValueType", "ТипЗначения");
	СписокРеквизитов.Вставить("Executed", "Выполнена");
	СписокРеквизитов.Вставить("Description", "Наименование");
	СписокРеквизитов.Вставить("RoutePoint", "ТочкаМаршрута");
	СписокРеквизитов.Вставить("BusinessProcess", "БизнесПроцесс");
	СписокРеквизитов.Вставить("PredefinedDataName", "ИмяПредопределенныхДанных");
	СписокРеквизитов.Вставить("Predefined", "Предопределенный");
	СписокРеквизитов.Вставить("Code", "Код");
	СписокРеквизитов.Вставить("ThisNode", "ЭтотУзел");
	СписокРеквизитов.Вставить("ReceivedNo", "НомерПринятого");
	СписокРеквизитов.Вставить("SentNo", "НомерОтправленного");
	СписокРеквизитов.Вставить("OffBalance", "Забалансовый");
	СписокРеквизитов.Вставить("Type", "Вид");
	СписокРеквизитов.Вставить("Account", "Счет");
	СписокРеквизитов.Вставить("RecordType", "ВидДвижения");
	СписокРеквизитов.Вставить("Active", "Активность");
	СписокРеквизитов.Вставить("LineNumber", "НомерСтроки");
	СписокРеквизитов.Вставить("Recorder", "Регистратор");
	СписокРеквизитов.Вставить("Period", "Период");
	СписокРеквизитов.Вставить("RegistrationPeriod", "ПериодРегистрации");
	СписокРеквизитов.Вставить("ReversingEntry", "Сторно");
	СписокРеквизитов.Вставить("CalculationType", "ВидРасчета");
	СписокРеквизитов.Вставить("Parent", "Родитель");
	СписокРеквизитов.Вставить("IsFolder", "ЭтоГруппа");
	СписокРеквизитов.Вставить("Owner", "Владелец");
	СписокРеквизитов.Вставить("Started", "Стартован");
	СписокРеквизитов.Вставить("HeadTask", "ВедущаяЗадача");
	СписокРеквизитов.Вставить("Completed", "Завершен");
	СписокРеквизитов.Вставить("Type", "Тип");
	СписокРеквизитов.Вставить("LeadingCalculationTypes", "ВедущиеВидыРасчета");
	СписокРеквизитов.Вставить("DataVersion", "ВерсияДанных");
	СписокРеквизитов.Вставить("ExtDimensionTypes", "ВидыСубконто");
	СписокРеквизитов.Вставить("TurnoversOnly", "ТолькоОбороты");
	СписокРеквизитов.Вставить("Predefined", "Предопределенное");
	СписокРеквизитов.Вставить("ExtDimensionType", "ВидСубконто");
	СписокРеквизитов.Вставить("LeadingCalculationTypes", "ВедущиеВидыРасчета");
	СписокРеквизитов.Вставить("DisplacingCalculationTypes", "ВытесняющиеВидыРасчета");
	СписокРеквизитов.Вставить("BaseCalculationTypes", "БазовыеВидыРасчета");		
		
	Возврат СписокРеквизитов;
	
КонецФункции

#КонецОбласти

#Область ПраваДоступа

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - ПеречислениеСсылка.гпр_ПраваДоступа -
//  * Значение - Строка - Имена реквизитов по правам доступа
//
Функция ИменаРеквизитовПоПравамДоступа() Экспорт

	Результат = Новый Соответствие();
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ВводПоСтроке, "ВводПоСтроке"); 
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Добавление, "Добавление");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Изменение, "Изменение");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеИсторииДанных, "ИзменениеИсторииДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеИсторииДанныхОтсутсвующихДанных, "ИзменениеИсторииДанныхОтсутсвующихДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеКомментарияВерсииИсторииДанных, "ИзменениеКомментарияВерсииИсторииДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИзменениеНастроекИсторииДанных, "ИзменениеНастроекИсторииДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПомеченных, "ИнтерактивноеУдалениеПомеченных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивнаяПометкаУдаления, "ИнтерактивнаяПометкаНаУдаление");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивнаяПометкаНаУдалениеПредопределенных, "ИнтерактивнаяПометкаНаУдалениеПредопределенных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеСнятиеПометкиУдаления, "ИнтерактивноеСнятиеПометкиУдаления");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеСнятиеПометкиУдаленияПредопределенных, "ИнтерактивноеСнятиеПометкиУдаленияПредопределенных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдаление, "ИнтерактивноеУдаление");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПомеченныхПредопределенных, "ИнтерактивноеУдалениеПомеченныхПредопределенных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеУдалениеПредопределенных, "ИнтерактивноеУдалениеПредопределенных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеДобавление, "ИнтерактивноеДобавление");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ПереходНаВерсиюИсторииДанных, "ПереходНаВерсиюИсторииДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Просмотр, "Просмотр");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ПросмотрИсторииДанных, "ПросмотрИсторииДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Редактирование, "Редактирование");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.РедактированияКомментарияВерсииИсторииДанных, "РедактированияКомментарияВерсииИсторииДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Удаление, "Удаление");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Чтение, "Чтение");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ЧтениеИсторииДанных, "ЧтениеИсторииДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ЧтениеИсторииДанныхОтсутствующихДанных, "ЧтениеИсторииДанныхОтсутствующихДанных");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Установка, "Установка");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Получение, "Получение");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.УправлениеИтогами, "УправлениеИтогами");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Использование, "Использование");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.Проведение, "Проведение");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеПроведение, "ИнтерактивноеПроведение");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеПроведениеНеОперативное, "ИнтерактивноеПроведениеНеОперативное");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ОтменаПроведения, "ОтменаПроведения");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивнаяОтменаПроведения, "ИнтерактивнаяОтменаПроведения");
	Результат.Вставить(Перечисления.гпр_ПраваДоступа.ИнтерактивноеИзменениеПроведенных, "ИнтерактивноеИзменениеПроведенных");
	Возврат Результат;

КонецФункции

// Возвращаемое значение:
//  Строка - Строковое представление права доступа.
//
Функция ИмяРеквизитаПоПравамДоступа(ПравоДоступа) Экспорт
	
	Возврат ИменаРеквизитовПоПравамДоступа().Получить(ПравоДоступа);
	
КонецФункции

#КонецОбласти

#Область СтандартныеРеквизиты

Функция СловарьСтандартныхРеквизитов()
	
	СписокРеквизитов = Новый Соответствие;
	СписокРеквизитов.Вставить("Ссылка", НСтр("ru = 'Ссылка'"));
	СписокРеквизитов.Вставить("Проведен", НСтр("ru = 'Проведен'"));
	СписокРеквизитов.Вставить("ПометкаУдаления", НСтр("ru = 'Пометка удаления'"));
	СписокРеквизитов.Вставить("Дата", НСтр("ru = 'Дата'"));
	СписокРеквизитов.Вставить("Номер", НСтр("ru = 'Номер'"));
	СписокРеквизитов.Вставить("ТипЗначения", НСтр("ru = 'Тип значения'"));
	СписокРеквизитов.Вставить("Выполнена", НСтр("ru = 'Выполнена'"));
	СписокРеквизитов.Вставить("Наименование", НСтр("ru = 'Наименование'"));
	СписокРеквизитов.Вставить("ТочкаМаршрута", НСтр("ru = 'Точка маршрута'"));
	СписокРеквизитов.Вставить("БизнесПроцесс", НСтр("ru = 'Бизнес процесс'"));
	СписокРеквизитов.Вставить("ИмяПредопределенныхДанных", НСтр("ru = 'Имя предопределенных данных'"));
	СписокРеквизитов.Вставить("Предопределенный", НСтр("ru = 'Предопределенный'"));
	СписокРеквизитов.Вставить("Код", НСтр("ru = 'Код'"));
	СписокРеквизитов.Вставить("ЭтотУзел", НСтр("ru = 'Этот узел'"));
	СписокРеквизитов.Вставить("НомерПринятого", НСтр("ru = 'Номер принятого'"));
	СписокРеквизитов.Вставить("НомерОтправленного", НСтр("ru = 'Номер отправленного'"));
	СписокРеквизитов.Вставить("Забалансовый", НСтр("ru = 'Забалансовый'"));
	СписокРеквизитов.Вставить("Вид", НСтр("ru = 'Вид'"));
	СписокРеквизитов.Вставить("Счет", НСтр("ru = 'Счет'"));
	СписокРеквизитов.Вставить("ВидДвижения", НСтр("ru = 'Вид движения'"));
	СписокРеквизитов.Вставить("Активность", НСтр("ru = 'Активность'"));
	СписокРеквизитов.Вставить("НомерСтроки", НСтр("ru = 'Номер строки'"));
	СписокРеквизитов.Вставить("Регистратор", НСтр("ru = 'Регистратор'"));
	СписокРеквизитов.Вставить("Период", НСтр("ru = 'Период'"));
	СписокРеквизитов.Вставить("ПериодРегистрации", НСтр("ru = 'Период регистрации'"));
	СписокРеквизитов.Вставить("Сторно", НСтр("ru = 'Сторно'"));
	СписокРеквизитов.Вставить("ВидРасчета", НСтр("ru = 'Вид расчета'"));
	СписокРеквизитов.Вставить("Родитель", НСтр("ru = 'Родитель'"));
	СписокРеквизитов.Вставить("ЭтоГруппа", НСтр("ru = 'Это группа'"));
	СписокРеквизитов.Вставить("Владелец", НСтр("ru = 'Владелец'"));
	СписокРеквизитов.Вставить("Стартован", НСтр("ru = 'Стартован'"));
	СписокРеквизитов.Вставить("ВедущаяЗадача", НСтр("ru = 'Ведущая задача'"));
	СписокРеквизитов.Вставить("Завершен", НСтр("ru = 'Завершен'"));
	СписокРеквизитов.Вставить("Тип", НСтр("ru = 'Тип'"));
	СписокРеквизитов.Вставить("ВедущиеВидыРасчета", НСтр("ru = 'Ведущие виды расчета'"));
	СписокРеквизитов.Вставить("ВерсияДанных", НСтр("ru = 'Версия данных'"));
	СписокРеквизитов.Вставить("ВидыСубконто", НСтр("ru = 'Виды субконто'"));
	СписокРеквизитов.Вставить("ТолькоОбороты", НСтр("ru = 'Только обороты'"));
	СписокРеквизитов.Вставить("Предопределенное", НСтр("ru = 'Предопределенное'"));
	СписокРеквизитов.Вставить("ВидСубконто", НСтр("ru = 'Вид субконто'"));
	СписокРеквизитов.Вставить("ВедущиеВидыРасчета", НСтр("ru = 'Ведущие виды расчета'"));
	СписокРеквизитов.Вставить("ВытесняющиеВидыРасчета", НСтр("ru = 'Вытесняющие виды расчета'"));
	СписокРеквизитов.Вставить("БазовыеВидыРасчета", НСтр("ru = 'Базовые виды расчета'"));
		
	Возврат СписокРеквизитов;
	
КонецФункции

Функция СинонимСтандатногоРеквизита(ИмяРеквизита) Экспорт
	
	Возврат СловарьСтандартныхРеквизитов().Получить(ИмяРеквизита);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьОбъектыКонфигурации(ИмяМетаданных, ОбъектыМетаданных)

	ЭтоПодсистема = (ИмяМетаданных = "Подсистемы");

	Для Каждого Объект Из Метаданные[ИмяМетаданных] Цикл
		
		// Объекты расширений не вывдим для редактора ролей
		Если Объект.РасширениеКонфигурации() <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеОбъекта = гпр_РаботаСКонфигурациейСервер.СвойстваОбъекта(Объект, ИмяМетаданных);
		
		Если ЭтоПодсистема Тогда
			
			ПолучитьПодчиненныеПодсистемы(Объект.Подсистемы, ДанныеОбъекта);
			
		КонецЕсли;
		
		ОбъектыМетаданных.Вставить(ДанныеОбъекта.Имя, ДанныеОбъекта);
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПолучитьПодчиненныеПодсистемы(ПодсистемыКонфигурации, ДанныеОбъекта)
	
	Для Каждого ПодсистемаПодсистемы Из ПодсистемыКонфигурации Цикл
		
		ДанныеПодсистемы = гпр_РаботаСКонфигурациейСервер.СвойстваОбъекта(ПодсистемаПодсистемы, ДанныеОбъекта.Представление);
		ПолучитьПодчиненныеПодсистемы(ПодсистемаПодсистемы.Подсистемы, ДанныеПодсистемы);
		ДанныеОбъекта.Вставить(ДанныеПодсистемы.Имя, ДанныеПодсистемы);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
